def main(Y):
    inputt = int(Y, 16)
    Y1 = inputt & ((1 << 9) - 1)
    Y2 = (inputt >> 9) & ((1 << 10) - 1)
    Y3 = (inputt >> 19) & ((1 << 9) - 1)
    Y4 = (inputt >> 28) & ((1 << 2) - 1)
    Y5 = (inputt >> 30) & ((1 << 4) - 1)
    return [('Y1', str(hex(Y1))), ('Y2', str(hex(Y2))), ('Y3', str(hex(Y3))),
            ('Y4', str(hex(Y4))), ('Y5', str(hex(Y5)))]


print("Ожидаем_1:    (('Y1': '0x1fb'), ('Y2': '0xa4'), ('Y3': '0x7f'), ('Y4': '0x0'), ('Y5': '0xd'))")
print("Реузльтат_1: ", main('0x343f949fb'), '\n')
print("Ожидаем_2:    (('Y1': '0x110'), ('Y2': '01c8'), ('Y3': '0x125'), ('Y4': '0x0'), ('Y5': '0x2'))")
print("Реузльтат_2: ", main('0x892b9110'), '\n')
print("Ожидаем_3:    (('Y1': '0x1b5'), ('Y2': '0x35f'), ('Y3': '0x165'), ('Y4': '0x1'), ('Y5': '0xc'))")
print("Реузльтат_3: ", main('0x31b2ebfb5'), '\n')
print("Ожидаем_4:    (('Y1': '0xc9'), ('Y2': '0xd4'), ('Y3': '0x7e'), ('Y4': '0x3'), ('Y5': '0xe'))")
print("Реузльтат_4: ", main('0x3b3f1a8c9'))
