import random


def rand_gen_doc():
    t1 = ["Михаил", "Александр", "Максим", "Марк", "Артем", "Лев", "Иван", "Матвей", "Дмитрий", "Тимофей", "Николай",
          "Андрей", "Алексей", "Владимир", "Владислав"]
    t2 = ["А.", "Б.", "В.", "Г.", "Д.", "Е.", "Ж.", "З.", "И.", "К.", "Л.", "М.", "Н.", "О.", "П.", "Р."]
    t3 = ["Груген", "Нертен", "Успенс", "Фейц", "Перл", "Морчен", "Курн", "Сиг", "Черн", "Шуц", "Саб", "Тяб", "Грин"]
    t4 = ["ов", "евич", "ий", "ёв", "як"]
    for _ in range(15):
        doc = ''
        doc += f"{random.choice(t1)} {random.choice(t2)} {random.choice(t3)}{random.choice(t4)}"
        print(doc)


rand_gen_doc()
